SELECT "Н_ЛЮДИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ" || ' ' ||  "Н_ЛЮДИ"."ОТЧЕСТВО" || ' '  ||"Н_ЛЮДИ"."ИМЯ" as ФИО,
       AVG("Н_ВЕДОМОСТИ"."ОЦЕНКА"::float) AS "СР_ОЦЕНКА"
FROM "Н_ЛЮДИ"
         JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         JOIN "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
WHERE "Н_УЧЕНИКИ"."ГРУППА" = '4100'
  AND "Н_ВЕДОМОСТИ"."ОЦЕНКА" NOT IN ('зачет', 'осв', 'незач', 'неявка', '99')
GROUP BY "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО"
HAVING AVG("Н_ВЕДОМОСТИ"."ОЦЕНКА"::float) =
       (SELECT MAX("СР_ОЦЕНКА")
        FROM (SELECT AVG("Н_ВЕДОМОСТИ"."ОЦЕНКА"::float) AS "СР_ОЦЕНКА"
              FROM "Н_ЛЮДИ"
                       JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                       JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
              WHERE "Н_УЧЕНИКИ"."ГРУППА" = '1100'
                AND "Н_ВЕДОМОСТИ"."ОЦЕНКА" NOT IN ('зачет', 'осв', 'незач', 'неявка', '99')
              GROUP BY "Н_ЛЮДИ"."ИД") AS "СР_ОЦЕНКИ_1100"); 