SELECT "Группа", "Количество студентов" FROM (
     SELECT "Н_УЧЕНИКИ"."ГРУППА" AS "Группа",
            COUNT(*) AS "Количество студентов"
     FROM "Н_ЛЮДИ"
              JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
              JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
              JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
     WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'ФКТИУ'
       AND EXTRACT(YEAR FROM "Н_УЧЕНИКИ"."НАЧАЛО") = 2011
     GROUP BY "Н_УЧЕНИКИ"."ГРУППА"
    ) as TMP
WHERE "Количество студентов" < 5
